In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser = Series(np.arange(3.))

data = DataFrame(np.arange(16).reshape(4,4),index=list('abcd'),columns=list('wxyz'))

data

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [3]:
data['w']  #选择表格中的'w'列，使用类字典属性,返回的是Series类型

a     0
b     4
c     8
d    12
Name: w, dtype: int64

In [4]:
data.w  #选择表格中的'w'列，使用点属性,返回的是Series类型

a     0
b     4
c     8
d    12
Name: w, dtype: int64

In [5]:
data[['w']]  #选择表格中的'w'列，返回的是DataFrame类型

    w
a   0
b   4
c   8
d  12

In [6]:
data[['w','z']]  #选择表格中的'w'、'z'列

    w   z
a   0   3
b   4   7
c   8  11
d  12  15

In [7]:
data[0:2]  #返回第1行到第2行的所有行，前闭后开，包括前不包括后

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [8]:
data[1:2]  #返回第2行，从0计，返回的是单行，通过有前后值的索引形式，如果采用data[1]则报错

   w  x  y  z
b  4  5  6  7

In [9]:
data.iloc[1:2]  # for positional indexing

   w  x  y  z
b  4  5  6  7

In [10]:
data.loc['a']  # for label based indexing

w    0
x    1
y    2
z    3
Name: a, dtype: int64

In [11]:
data['a':'b']  #利用index值进行切片，返回的是**前闭后闭**的DataFrame，即末端是包含的

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [12]:
data.head()  #返回data的前几行数据，默认为前五行，需要前十行则data.head(10)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [13]:
data.tail()  #返回data的后几行数据，默认为后五行，需要后十行则data.tail(10)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [14]:
data.iloc[-1]   #选取DataFrame最后一行，返回的是Series

w    12
x    13
y    14
z    15
Name: d, dtype: int64

In [15]:
data.iloc[-1:]   #选取DataFrame最后一行，返回的是DataFrame

    w   x   y   z
d  12  13  14  15

In [16]:
data.loc['a',['w','x']]   #返回‘a’行'w'、'x'列，这种用于选取行索引列索引已知

w    0
x    1
Name: a, dtype: int64

In [17]:
data.iat[1,1]   #选取第二行第二列，用于已知行、列位置的选取

5

In [18]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [19]:
data = DataFrame(np.arange(15).reshape(3,5),index=['one','two','three'],columns=['a','b','c','d','e'])

In [20]:
data

        a   b   c   d   e
one     0   1   2   3   4
two     5   6   7   8   9
three  10  11  12  13  14

In [21]:
from pandas.io.parsers import read_csv

In [22]:
df = read_csv('./data/tencent_hr.csv')  #从CSV中读取

In [23]:
df

,work_place,work_type,work_time,work_count,work_name
0,北京,技术类,2017-12-20,1,MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1,北京,技术类,2017-12-20,1,WXG08-122 微信数据挖掘算法高级工程师（北京）
2,北京,技术类,2017-12-20,1,OMG097-测试开发工程师（北京）
3,北京,技术类,2017-12-20,2,OMG236-腾讯视频推荐算法高级工程师（北京）
4,北京,技术类,2017-12-20,1,23671-高级数据分析开发工程师(北京）
5,北京,技术类,2017-12-20,1,22090-天天快报-文本分析与挖掘高级工程师（北京）
6,北京,技术类,2017-12-20,1,WXG08-121 微信机器学习算法工程师（北京）
7,北京,技术类,2017-12-20,3,23674-腾讯新闻高级系统测试工程师
8,北京,技术类,2017-12-20,1,SA-腾讯社交广告高级系统测试工程师（北京）
9,北京,技术类,2017-12-19,2,22989-腾讯云高级后台开发工程师（北京）
10,北京,技术类,2017-12-19,2,22989-云计算研发工程师（北京）
11,北京,技术类,2017-12-19,3,22989-腾讯云高级后台开发(互联网业务)（北京）
12,北京,技术类,2017-12-19,1,OMG097-数据挖掘工程师(北京）
13,北京,技术类,2017-12-18,2,23674-搜索架构高级工程师
14,北京,产品/项目类,2017-12-18,1,22090-天天快报-数据产品组组长（北京）
15,北京,技术类,2017-12-19,3,TEG02-控制器研发工程师（北京）
16,北京,技术类,2017-12-19,1,22989-高级图像处理算法工程师（北京）
17,北京,技术类,2017-12-19,1,WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18,北京,技术类,2017-12-18,2,23674-新闻搜索算法高级工程师
19,北京,技术类,2017-12-18,1,OMG097-后台开发高级工程师(北京）
20,北京,技术类,2017-12-18,1,MIG03-数据评测工程师（北京）
21,北京,技术类,2017-12-16,2,OMG097-数据挖掘工程师(北京）
22,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
23,北京,技术类,2017-12-15,1,SA-腾讯社交广告联盟策略开发工程师（北京）
24,北京,技术类,2017-12-14,1,23048-内容推荐算法高级工程师（北京）
25,北京,技术类,2017-12-18,1,MIG16-地图专题数据后台开发工程师-功能方向（北京）
26,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
27,北京,技术类,2017-12-15,2,MIG16-地图数据高级后台工程师（北京）
28,北京,技术类,2017-12-14,1,TEG05-高级安全数据研究员(北京）
29,北京,技术类,2017-12-14,2,SA-腾讯社交广告算法工程师（质量研发中心 北京）
...,...,...,...,...,...
52,北京,技术类,2017-11-27,1,MIG16-地图导航后台开发工程师(北京)
53,北京,技术类,2017-11-26,1,23048-翻译君后台开发高级工程师（北京）
54,北京,技术类,2017-11-21,2,TEG03-高级算法研发工程师（深圳）
55,北京,技术类,2017-12-01,1,22989-云存储资深研发工程师（北京）
56,北京,技术类,2017-12-01,1,MIG15-自然语言处理高级算法研究员
57,北京,技术类,2017-11-26,1,SA-腾讯社交广告定向系统开发工程师（北京）
58,北京,技术类,2017-11-22,2,OMG236-腾讯视频自然语言处理高级工程师（北京）
59,北京,技术类,2017-11-21,1,17757-高级数据挖掘工程师（北京）
60,北京,技术类,2017-11-21,3,MIG16-地图导航惯导开发工程师（北京）
61,北京,技术类,2017-11-13,1,TEG17-AI LAB语音识别研发工程师(深圳）
62,北京,技术类,2017-11-08,1,MIG16-地图众包业务后台开发高级工程师（北京）
63,北京,技术类,2017-11-06,2,MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64,北京,技术类,2017-11-03,1,MIG16-地图POI数据挖掘高级研发工程师（北京）
65,北京,技术类,2017-11-16,1,SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66,北京,技术类,2017-11-08,1,23674-腾讯新闻后台测试组长
67,北京,技术类,2017-11-06,0,MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68,北京,技术类,2017-11-03,1,MIG16-地图POI数据自然语言处理工程师（北京）
69,北京,技术类,2017-11-02,1,MIG16-地图后台高级研发工程师-融合方向（北京）
70,北京,技术类,2017-11-01,3,MIG16-AI算法研究（北京）
71,北京,技术类,2017-11-01,1,MIG16-基础架构工程师（北京）
72,北京,技术类,2017-10-30,2,MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合感知(北京)
74,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合定位(北京)
75,北京,技术类,2017-11-01,2,MIG16-运营后台开发工程师（北京）
76,北京,技术类,2017-11-01,1,MIG16-地图大数据挖掘工程师（北京）
77,北京,技术类,2017-10-30,1,22090-天天快报-图像算法工程师（北京）
78,北京,技术类,2017-10-26,1,MIG16-自动驾驶深度学习(北京)
79,北京,技术类,2017-10-25,1,MIG16-计算机视觉高级算法工程师（北京）
80,北京,技术类,2017-09-27,1,23048-翻译君语料数据工程师（北京）
81,北京,技术类,2017-09-27,2,SA-腾讯社交广告测试开发工程师（北京）

In [24]:
df.shape  #数据结构的形状

(82, 5)

In [25]:
df.columns

Index(['work_place', 'work_type', 'work_time', 'work_count', 'work_name'], dtype='object')

In [26]:
df.dtypes

work_place    object
work_type     object
work_time     object
work_count     int64
work_name     object
dtype: object

In [27]:
df.index

RangeIndex(start=0, stop=82, step=1)

In [28]:
df.values

array([['北京', '技术类', '2017-12-20', 1, 'MIG16-位置大数据机器学习/深度学习算法研究员（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'WXG08-122 微信数据挖掘算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'OMG097-测试开发工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 2, 'OMG236-腾讯视频推荐算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, '23671-高级数据分析开发工程师(北京）'],
       ['北京', '技术类', '2017-12-20', 1, '22090-天天快报-文本分析与挖掘高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'WXG08-121 微信机器学习算法工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 3, '23674-腾讯新闻高级系统测试工程师'],
       ['北京', '技术类', '2017-12-20', 1, 'SA-腾讯社交广告高级系统测试工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 2, '22989-腾讯云高级后台开发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 2, '22989-云计算研发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 3, '22989-腾讯云高级后台开发(互联网业务)（北京）'],
       ['北京', '技术类', '2017-12-19', 1, 'OMG097-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-18', 2, '23674-搜索架构高级工程师'],
       ['北京', '产品/项目类', '2017-12-18', 1, '22090-天天快报-数据产品组组长（北京）'],
       ['北京', '技术类', '2017-12-19', 3, 'TEG02-控制器研发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 1, '22989-高级图像处理算法工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 1, 'WXG08-121 微信模式识别自然语言处理算法工程师（北京）'],
       ['北京', '技术类', '2017-12-18', 2, '23674-新闻搜索算法高级工程师'],
       ['北京', '技术类', '2017-12-18', 1, 'OMG097-后台开发高级工程师(北京）'],
       ['北京', '技术类', '2017-12-18', 1, 'MIG03-数据评测工程师（北京）'],
       ['北京', '技术类', '2017-12-16', 2, 'OMG097-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-15', 3, 'MIG07-系统安全研究员（北京）'],
       ['北京', '技术类', '2017-12-15', 1, 'SA-腾讯社交广告联盟策略开发工程师（北京）'],
       ['北京', '技术类', '2017-12-14', 1, '23048-内容推荐算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-18', 1, 'MIG16-地图专题数据后台开发工程师-功能方向（北京）'],
       ['北京', '技术类', '2017-12-15', 3, 'MIG07-系统安全研究员（北京）'],
       ['北京', '技术类', '2017-12-15', 2, 'MIG16-地图数据高级后台工程师（北京）'],
       ['北京', '技术类', '2017-12-14', 1, 'TEG05-高级安全数据研究员(北京）'],
       ['北京', '技术类', '2017-12-14', 2, 'SA-腾讯社交广告算法工程师（质量研发中心 北京）'],
       ['北京', '技术类', '2017-12-13', 2, '22989-腾讯云大客户售后高级顾问（北京）'],
       ['北京', '技术类', '2017-12-13', 2, '22989-腾讯云行业架构师（北京）'],
       ['北京', '技术类', '2017-12-12', 1, 'WXG02-116 测试开发工程师'],
       ['北京', '技术类', '2017-12-11', 1, '15503-系统漏洞研究工程师（北京）'],
       ['北京', '产品/项目类', '2017-12-07', 1, '22989-腾讯云AI行业方案专家（北京）'],
       ['北京', '技术类', '2017-12-13', 2, '23674-腾讯新闻大数据分析工程师'],
       ['北京', '技术类', '2017-12-13', 1, 'MIG16-腾讯地图自然语言处理高级工程师(北京)'],
       ['北京', '技术类', '2017-12-12', 1, 'OMG236-腾讯视频搜索数据模型高级工程师(北京)'],
       ['北京', '技术类', '2017-12-11', 1, '23671-数据开发工程师（北京）'],
       ['北京', '技术类', '2017-12-06', 1, '22989-腾讯云PAAS产品中心高级后端开发（北京）'],
       ['北京', '技术类', '2017-12-06', 1, 'WXG08-121 模式识别机器学习（高级）算法工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 1, 'MIG07-企业安全运营工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 0, 'OMG097-业务运维（北京）'],
       ['北京', '技术类', '2017-12-04', 2, 'TEG11-机器翻译语料挖掘工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 1, 'TEG13-图像OCR算法工程师(北京)'],
       ['北京', '技术类', '2017-12-06', 1, 'WXG08-121 模式识别自然语言处理（高级）算法工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 4, 'SNG02-自然语言处理高级研发工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 1, 'WXG08-113 微信搜索后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 2, '22086-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-02', 1, 'MIG03-腾讯地图高级算法评测工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-C++后台开发工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-分布式存储高级研发工程师（北京）'],
       ['北京', '技术类', '2017-11-27', 1, 'MIG16-地图导航后台开发工程师(北京)'],
       ['北京', '技术类', '2017-11-26', 1, '23048-翻译君后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 2, 'TEG03-高级算法研发工程师（深圳）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-云存储资深研发工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, 'MIG15-自然语言处理高级算法研究员'],
       ['北京', '技术类', '2017-11-26', 1, 'SA-腾讯社交广告定向系统开发工程师（北京）'],
       ['北京', '技术类', '2017-11-22', 2, 'OMG236-腾讯视频自然语言处理高级工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 1, '17757-高级数据挖掘工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 3, 'MIG16-地图导航惯导开发工程师（北京）'],
       ['北京', '技术类', '2017-11-13', 1, 'TEG17-AI LAB语音识别研发工程师(深圳）'],
       ['北京', '技术类', '2017-11-08', 1, 'MIG16-地图众包业务后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-11-06', 2, 'MIG16-自动驾驶数据平台大数据高级系统架构师(北京)'],
       ['北京', '技术类', '2017-11-03', 1, 'MIG16-地图POI数据挖掘高级研发工程师（北京）'],
       ['北京', '技术类', '2017-11-16', 1, 'SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）'],
       ['北京', '技术类', '2017-11-08', 1, '23674-腾讯新闻后台测试组长'],
       ['北京', '技术类', '2017-11-06', 0, 'MIG16-自动驾驶数据平台高级后台开发工程师(北京)'],
       ['北京', '技术类', '2017-11-03', 1, 'MIG16-地图POI数据自然语言处理工程师（北京）'],
       ['北京', '技术类', '2017-11-02', 1, 'MIG16-地图后台高级研发工程师-融合方向（北京）'],
       ['北京', '技术类', '2017-11-01', 3, 'MIG16-AI算法研究（北京）'],
       ['北京', '技术类', '2017-11-01', 1, 'MIG16-基础架构工程师（北京）'],
       ['北京', '技术类', '2017-10-30', 2, 'MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶融合感知(北京)'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶融合定位(北京)'],
       ['北京', '技术类', '2017-11-01', 2, 'MIG16-运营后台开发工程师（北京）'],
       ['北京', '技术类', '2017-11-01', 1, 'MIG16-地图大数据挖掘工程师（北京）'],
       ['北京', '技术类', '2017-10-30', 1, '22090-天天快报-图像算法工程师（北京）'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶深度学习(北京)'],
       ['北京', '技术类', '2017-10-25', 1, 'MIG16-计算机视觉高级算法工程师（北京）'],
       ['北京', '技术类', '2017-09-27', 1, '23048-翻译君语料数据工程师（北京）'],
       ['北京', '技术类', '2017-09-27', 2, 'SA-腾讯社交广告测试开发工程师（北京）']], dtype=object)

In [29]:
col = df[df.columns[4]]  #选中DataFrame一列，则为Series型数据
col

0       MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         WXG08-122 微信数据挖掘算法高级工程师（北京）
2                  OMG097-测试开发工程师（北京）
3            OMG236-腾讯视频推荐算法高级工程师（北京）
4               23671-高级数据分析开发工程师(北京）
5         22090-天天快报-文本分析与挖掘高级工程师（北京）
6           WXG08-121 微信机器学习算法工程师（北京）
7                 23674-腾讯新闻高级系统测试工程师
8              SA-腾讯社交广告高级系统测试工程师（北京）
9              22989-腾讯云高级后台开发工程师（北京）
10                 22989-云计算研发工程师（北京）
11         22989-腾讯云高级后台开发(互联网业务)（北京）
12                 OMG097-数据挖掘工程师(北京）
13                    23674-搜索架构高级工程师
14             22090-天天快报-数据产品组组长（北京）
15                 TEG02-控制器研发工程师（北京）
16              22989-高级图像处理算法工程师（北京）
17    WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18                  23674-新闻搜索算法高级工程师
19               OMG097-后台开发高级工程师(北京）
20                  MIG03-数据评测工程师（北京）
21                 OMG097-数据挖掘工程师(北京）
22                  MIG07-系统安全研究员（北京）
23             SA-腾讯社交广告联盟策略开发工程师（北京）
24              23048-内容推荐算法高级工程师（北京）
25       MIG16-地图专题数据后台开发工程师-功能方向（北京）
26                  MIG07-系统安全研究员（北京）
27              MIG16-地图数据高级后台工程师（北京）
28                TEG05-高级安全数据研究员(北京）
29          SA-腾讯社交广告算法工程师（质量研发中心 北京）
                   ...
52              MIG16-地图导航后台开发工程师(北京)
53             23048-翻译君后台开发高级工程师（北京）
54                TEG03-高级算法研发工程师（深圳）
55               22989-云存储资深研发工程师（北京）
56                MIG15-自然语言处理高级算法研究员
57             SA-腾讯社交广告定向系统开发工程师（北京）
58         OMG236-腾讯视频自然语言处理高级工程师（北京）
59                17757-高级数据挖掘工程师（北京）
60              MIG16-地图导航惯导开发工程师（北京）
61          TEG17-AI LAB语音识别研发工程师(深圳）
62          MIG16-地图众包业务后台开发高级工程师（北京）
63       MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64         MIG16-地图POI数据挖掘高级研发工程师（北京）
65       SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66                   23674-腾讯新闻后台测试组长
67        MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68         MIG16-地图POI数据自然语言处理工程师（北京）
69         MIG16-地图后台高级研发工程师-融合方向（北京）
70                   MIG16-AI算法研究（北京）
71                  MIG16-基础架构工程师（北京）
72    MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73                 MIG16-自动驾驶融合感知(北京)
74                 MIG16-自动驾驶融合定位(北京)
75                MIG16-运营后台开发工程师（北京）
76               MIG16-地图大数据挖掘工程师（北京）
77             22090-天天快报-图像算法工程师（北京）
78                 MIG16-自动驾驶深度学习(北京)
79             MIG16-计算机视觉高级算法工程师（北京）
80               23048-翻译君语料数据工程师（北京）
81               SA-腾讯社交广告测试开发工程师（北京）
Name: work_name, Length: 82, dtype: object

In [30]:
col.shape  #输出每维的长度，numpy的函数同样适用于pandas

(82,)

In [31]:
col[1:6]

1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2             OMG097-测试开发工程师（北京）
3       OMG236-腾讯视频推荐算法高级工程师（北京）
4          23671-高级数据分析开发工程师(北京）
5    22090-天天快报-文本分析与挖掘高级工程师（北京）
Name: work_name, dtype: object

In [32]:
import numpy as np
import pandas as pd


data = {'Weather': ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * np.random.rand(7), 'Number' : np.random.randint(1, 9 + 1, size=(7,))}
df = pd.DataFrame(data)

In [33]:
weather_group = df.groupby('Weather')  #数据聚合，按weather分组
i = 0
for name, group in weather_group:  #name为weather的名字，group为该类中的项
    i += 1
    print(i, name)
    print(group)

1 cold
       Food  Number     Price Weather
0      soup       6  3.287902    cold
2  icecream       2  3.141866    cold
4  icecream       5  8.575471    cold
6      soup       8  0.353093    cold
2 hot
        Food  Number     Price Weather
1       soup       4  8.450388     hot
3  chocolate       5  4.877803     hot
5   icecream       2  9.701518     hot

In [34]:
weather_group.first()

         Food  Number     Price
Weather
cold     soup       6  3.287902
hot      soup       4  8.450388

In [35]:
weather_group.last()

             Food  Number     Price
Weather
cold         soup       8  0.353093
hot      icecream       2  9.701518

In [36]:
weather_group.mean()

           Number     Price
Weather
cold     5.250000  3.839583
hot      3.666667  7.676570

In [37]:
wf_group = df.groupby(['Weather', 'Food'])
for name, group in wf_group:
    print(name)
    print(group)

('cold', 'icecream')
       Food  Number     Price Weather
2  icecream       2  3.141866    cold
4  icecream       5  8.575471    cold
('cold', 'soup')
   Food  Number     Price Weather
0  soup       6  3.287902    cold
6  soup       8  0.353093    cold
('hot', 'chocolate')
        Food  Number     Price Weather
3  chocolate       5  4.877803     hot
('hot', 'icecream')
       Food  Number     Price Weather
5  icecream       2  9.701518     hot
('hot', 'soup')
   Food  Number     Price Weather
1  soup       4  8.450388     hot

In [38]:
print(wf_group.agg([np.mean, np.median]))  # 通过agg()可以对数据组施加一系列的NumPy函数

                  Number            Price
                    mean median      mean    median
Weather Food
cold    icecream     3.5    3.5  5.858669  5.858669
        soup         7.0    7.0  1.820497  1.820497
hot     chocolate    5.0    5.0  4.877803  4.877803
        icecream     2.0    2.0  9.701518  9.701518
        soup         4.0    4.0  8.450388  8.450388

In [39]:
print(pd.concat([df[:3],df[3:]]))  #串联
print(df[:3].append(df[5:]))  #串联

        Food  Number     Price Weather
0       soup       6  3.287902    cold
1       soup       4  8.450388     hot
2   icecream       2  3.141866    cold
3  chocolate       5  4.877803     hot
4   icecream       5  8.575471    cold
5   icecream       2  9.701518     hot
6       soup       8  0.353093    cold
       Food  Number     Price Weather
0      soup       6  3.287902    cold
1      soup       4  8.450388     hot
2  icecream       2  3.141866    cold
5  icecream       2  9.701518     hot
6      soup       8  0.353093    cold

In [40]:
import numpy as np
import pandas as pd


print(pd.date_range('1/1/2018',periods=30,freq='D'))  #生成时间列表，周期为42天，D
print(pd.to_datetime(['20181231','1/1/2017']))  #将字符串转化为日期数据

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12',
               '2018-01-13', '2018-01-14', '2018-01-15', '2018-01-16',
               '2018-01-17', '2018-01-18', '2018-01-19', '2018-01-20',
               '2018-01-21', '2018-01-22', '2018-01-23', '2018-01-24',
               '2018-01-25', '2018-01-26', '2018-01-27', '2018-01-28',
               '2018-01-29', '2018-01-30'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2018-12-31', '2017-01-01'], dtype='datetime64[ns]', freq=None)

In [41]:
import numpy as np
import pandas as pd


data = {'Weather' : ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * np.random.rand(7), 'Number' : np.random.randint(1, 9 + 1, size=(7,))}
df = pd.DataFrame(data)   #根据字典创建DataFrame
print(pd.pivot_table(df,columns=['Food'],aggfunc=np.max))   #np.max不能加括号
print(pd.pivot_table(df,columns=['Food'],aggfunc=np.sum))   #np.sum不能加括号

Food    chocolate icecream    soup
Number          6        5       9
Price     3.83097  7.52713  8.5589
Weather       hot      hot     hot
Food    chocolate   icecream       soup
Number   6.000000  13.000000  18.000000
Price    3.830973  11.413628  13.916491

## Sorting and Ranking （排序）

按row或column index来排序的话，可以用sort_index方法，会返回一个新的object：

In [42]:
import numpy as np
import pandas as pd

In [43]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [44]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

在DataFrame，可以用index或其他axis来排序：

In [45]:
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [46]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [47]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

默认是升序，可以设置降序：

In [48]:
df.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

通过值来排序，用sort_values方法：

In [49]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

缺失值会被排在最后：

In [50]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

对于一个DataFrame，可以用一列或多列作为sort keys。这样的话，只需要把一列或多列的名字导入到sort_values即可：

In [51]:
df = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
df

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [52]:
df.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

多列排序的话，传入一个list of names：

In [53]:
df.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

ranking（排名）是给有效的数据分配数字。rank方法能用于series和DataFrame，rank方法默认会给每个group一个mean rank（平均排名）。rank 表示在这个数在原来的Series中排第几名，有相同的数，取其排名平均（默认）作为值：

In [54]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [55]:
obj.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [56]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

在obj中，4和4的排名是第4名和第五名，取平均得4.5。7和7的排名分别是第六名和第七名，则其排名取平均得6.5。

rank也可以根据数据被观测到的顺序来设定：

In [57]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

这里没有给0和2(指两个数字7)赋予average rank 6.5，而是给第一个看到的7（label 0）设置rank为6，第二个看到的7（label 2）设置rank为7。

也可以设置降序：

In [58]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame 可以根据行或列来计算rank：

In [59]:
df = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
df

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [60]:
df.rank(axis='columns') # columns表示列与列之间的排序（即每一行里数据间的排序）

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## Reading Text Files in Pieces（读取一部分文本）

对于一些比较大的文件，我们想要一次读取一小部分，或者每次迭代一小部分。在我们看一个比较大的文件前，先设置一下pandas中显示的数量：

In [61]:
import numpy as np
import pandas as pd

In [62]:
result = pd.read_csv('./data/tencent_hr.csv')
result

,work_place,work_type,work_time,work_count,work_name
0,北京,技术类,2017-12-20,1,MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1,北京,技术类,2017-12-20,1,WXG08-122 微信数据挖掘算法高级工程师（北京）
2,北京,技术类,2017-12-20,1,OMG097-测试开发工程师（北京）
3,北京,技术类,2017-12-20,2,OMG236-腾讯视频推荐算法高级工程师（北京）
4,北京,技术类,2017-12-20,1,23671-高级数据分析开发工程师(北京）
5,北京,技术类,2017-12-20,1,22090-天天快报-文本分析与挖掘高级工程师（北京）
6,北京,技术类,2017-12-20,1,WXG08-121 微信机器学习算法工程师（北京）
7,北京,技术类,2017-12-20,3,23674-腾讯新闻高级系统测试工程师
8,北京,技术类,2017-12-20,1,SA-腾讯社交广告高级系统测试工程师（北京）
9,北京,技术类,2017-12-19,2,22989-腾讯云高级后台开发工程师（北京）
10,北京,技术类,2017-12-19,2,22989-云计算研发工程师（北京）
11,北京,技术类,2017-12-19,3,22989-腾讯云高级后台开发(互联网业务)（北京）
12,北京,技术类,2017-12-19,1,OMG097-数据挖掘工程师(北京）
13,北京,技术类,2017-12-18,2,23674-搜索架构高级工程师
14,北京,产品/项目类,2017-12-18,1,22090-天天快报-数据产品组组长（北京）
15,北京,技术类,2017-12-19,3,TEG02-控制器研发工程师（北京）
16,北京,技术类,2017-12-19,1,22989-高级图像处理算法工程师（北京）
17,北京,技术类,2017-12-19,1,WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18,北京,技术类,2017-12-18,2,23674-新闻搜索算法高级工程师
19,北京,技术类,2017-12-18,1,OMG097-后台开发高级工程师(北京）
20,北京,技术类,2017-12-18,1,MIG03-数据评测工程师（北京）
21,北京,技术类,2017-12-16,2,OMG097-数据挖掘工程师(北京）
22,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
23,北京,技术类,2017-12-15,1,SA-腾讯社交广告联盟策略开发工程师（北京）
24,北京,技术类,2017-12-14,1,23048-内容推荐算法高级工程师（北京）
25,北京,技术类,2017-12-18,1,MIG16-地图专题数据后台开发工程师-功能方向（北京）
26,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
27,北京,技术类,2017-12-15,2,MIG16-地图数据高级后台工程师（北京）
28,北京,技术类,2017-12-14,1,TEG05-高级安全数据研究员(北京）
29,北京,技术类,2017-12-14,2,SA-腾讯社交广告算法工程师（质量研发中心 北京）
...,...,...,...,...,...
52,北京,技术类,2017-11-27,1,MIG16-地图导航后台开发工程师(北京)
53,北京,技术类,2017-11-26,1,23048-翻译君后台开发高级工程师（北京）
54,北京,技术类,2017-11-21,2,TEG03-高级算法研发工程师（深圳）
55,北京,技术类,2017-12-01,1,22989-云存储资深研发工程师（北京）
56,北京,技术类,2017-12-01,1,MIG15-自然语言处理高级算法研究员
57,北京,技术类,2017-11-26,1,SA-腾讯社交广告定向系统开发工程师（北京）
58,北京,技术类,2017-11-22,2,OMG236-腾讯视频自然语言处理高级工程师（北京）
59,北京,技术类,2017-11-21,1,17757-高级数据挖掘工程师（北京）
60,北京,技术类,2017-11-21,3,MIG16-地图导航惯导开发工程师（北京）
61,北京,技术类,2017-11-13,1,TEG17-AI LAB语音识别研发工程师(深圳）
62,北京,技术类,2017-11-08,1,MIG16-地图众包业务后台开发高级工程师（北京）
63,北京,技术类,2017-11-06,2,MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64,北京,技术类,2017-11-03,1,MIG16-地图POI数据挖掘高级研发工程师（北京）
65,北京,技术类,2017-11-16,1,SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66,北京,技术类,2017-11-08,1,23674-腾讯新闻后台测试组长
67,北京,技术类,2017-11-06,0,MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68,北京,技术类,2017-11-03,1,MIG16-地图POI数据自然语言处理工程师（北京）
69,北京,技术类,2017-11-02,1,MIG16-地图后台高级研发工程师-融合方向（北京）
70,北京,技术类,2017-11-01,3,MIG16-AI算法研究（北京）
71,北京,技术类,2017-11-01,1,MIG16-基础架构工程师（北京）
72,北京,技术类,2017-10-30,2,MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合感知(北京)
74,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合定位(北京)
75,北京,技术类,2017-11-01,2,MIG16-运营后台开发工程师（北京）
76,北京,技术类,2017-11-01,1,MIG16-地图大数据挖掘工程师（北京）
77,北京,技术类,2017-10-30,1,22090-天天快报-图像算法工程师（北京）
78,北京,技术类,2017-10-26,1,MIG16-自动驾驶深度学习(北京)
79,北京,技术类,2017-10-25,1,MIG16-计算机视觉高级算法工程师（北京）
80,北京,技术类,2017-09-27,1,23048-翻译君语料数据工程师（北京）
81,北京,技术类,2017-09-27,2,SA-腾讯社交广告测试开发工程师（北京）

In [63]:
pd.options.display.max_rows = 10

In [64]:
result

   work_place work_type   work_time  work_count                      work_name
0          北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1          北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2          北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3          北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4          北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）
..        ...       ...         ...         ...                            ...
77         北京       技术类  2017-10-30           1         22090-天天快报-图像算法工程师（北京）
78         北京       技术类  2017-10-26           1             MIG16-自动驾驶深度学习(北京)
79         北京       技术类  2017-10-25           1         MIG16-计算机视觉高级算法工程师（北京）
80         北京       技术类  2017-09-27           1           23048-翻译君语料数据工程师（北京）
81         北京       技术类  2017-09-27           2           SA-腾讯社交广告测试开发工程师（北京）

[82 rows x 5 columns]

如果只是想要读取前几行（不读取整个文件），指定一下nrows：

In [65]:
pd.read_csv('./data/tencent_hr.csv', nrows=5)

  work_place work_type   work_time  work_count                      work_name
0         北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2         北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3         北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4         北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）

读取文件的一部分，可以指定chunksize：

In [66]:
chunker = pd.read_csv('./data/tencent_hr.csv', chunksize=1000)
chunker

pandas返回的TextParser object能让我们根据chunksize每次迭代文件的一部分。
TextParser有一个get_chunk方法，能返回任意大小的数据片段：

In [67]:
chunker.get_chunk(10)

  work_place work_type   work_time  work_count                      work_name
0         北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2         北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3         北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4         北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）
5         北京       技术类  2017-12-20           1    22090-天天快报-文本分析与挖掘高级工程师（北京）
6         北京       技术类  2017-12-20           1      WXG08-121 微信机器学习算法工程师（北京）
7         北京       技术类  2017-12-20           3            23674-腾讯新闻高级系统测试工程师
8         北京       技术类  2017-12-20           1         SA-腾讯社交广告高级系统测试工程师（北京）
9         北京       技术类  2017-12-19           2         22989-腾讯云高级后台开发工程师（北京）

## Handling Missing Data

In [68]:
import pandas as pd
import numpy as np

In [69]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [70]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [71]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [72]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

对于DataFrame，会复杂一些。你可能想要删除包含有NA的row和column。dropna默认会删除包含有缺失值的row：

In [73]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [74]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

设定how=all只会删除那些全是NA的行：

In [75]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [76]:
data[3] = np.nan
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [77]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [78]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.791904  1.571828 -1.041767
1  1.912676  0.167740 -0.305128
2 -0.568826  0.670875  2.066170
3  0.203546 -0.520986  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

In [79]:
df.iloc[:4, 1] = np.nan
df

          0         1         2
0 -0.791904       NaN -1.041767
1  1.912676       NaN -0.305128
2 -0.568826       NaN  2.066170
3  0.203546       NaN  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

In [80]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.791904       NaN       NaN
1  1.912676       NaN       NaN
2 -0.568826       NaN  2.066170
3  0.203546       NaN  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

In [81]:
df.dropna()

          0         1         2
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

In [82]:
df.dropna(thresh=2)  # 在一行中至少有2个非 NA 值时将其保留

          0         1         2
2 -0.568826       NaN  2.066170
3  0.203546       NaN  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

不是删除缺失值，而是用一些数字填补。对于大部分目的，fillna是可以用的。调用fillna的时候设置好一个常用用来替换缺失值：

In [83]:
df.fillna(0)

          0         1         2
0 -0.791904  0.000000  0.000000
1  1.912676  0.000000  0.000000
2 -0.568826  0.000000  2.066170
3  0.203546  0.000000  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

给fillna传入一个dict，可以给不同列替换不同的值：

In [84]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.791904  0.500000  0.000000
1  1.912676  0.500000  0.000000
2 -0.568826  0.500000  2.066170
3  0.203546  0.500000  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

fillna返回一个新对象，但你可以使用inplace来直接更改原有的数据：

In [85]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.791904  0.000000  0.000000
1  1.912676  0.000000  0.000000
2 -0.568826  0.000000  2.066170
3  0.203546  0.000000  0.312207
4  0.019568 -1.542886 -2.147686
5 -0.892650  0.575641 -3.317753
6 -0.182588 -0.850216 -0.027820

## Data Transformation（数据变换）

In [86]:
import pandas as pd
import numpy as np

In [87]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

DataFrame方法duplicated返回的是一个boolean Series，表示一个row是否是重复的（根据前一行来判断）：

In [88]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

drop_duplicateds返回一个DataFrame，会删除重复的部分：

In [89]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

上面两种方法都默认考虑所有列；另外，我们可以指定一部分来检测重复值。假设我们只想检测'k1'列的重复值：

In [90]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [91]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated和drop_duplicated默认保留第一次观测到的数值组合。设置keep='last'能返回最后一个：

In [92]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [93]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

假设你想加一列，表明每种肉来源的动物是什么。我们可以写一个映射：

In [94]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

用于series的map方法接受一个函数，或是一个字典，包含着映射关系，但这里有一个小问题，有些肉是大写，有些是小写。因此，我们先用str.lower把所有的值变为小写：

In [95]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [96]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

我们也可以用一个函数解决上面的问题：

In [97]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

使用map是一个很简便的方法，用于element-wise转换和其他一些数据清洗操作。

其实fillna是一个特殊的替换操作，map可以用于修改一个object里的部分值，但是replace能提供一个更简单和更灵活的方法做到这点。

In [98]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [99]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

如果想要一次替换多个值，直接用一个list即可：

In [100]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

对于不同的值用不同的替换值，也是使用一个list：

In [101]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

参数也可以是一个dict：

In [102]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

注意：data.replace方法和data.str.replace方法是不同的，后者会对string进行element-wise替换。

In [103]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [104]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [105]:
data.index = data.index.map(lambda x: x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

如果你想要创建一个转换后的版本，而且不用修改原始的数据，可以用rename：

In [106]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [107]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'pekaboo'})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [108]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

连续型数据经常被离散化或分散成bins（分箱）来分析。假设你有一组数据，你想把人分到不同的年龄组里：

In [109]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

我们把这些分到四个bin里，19~25，26~35，36~60，>60。可以用pandas里的cut：

In [110]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

返回的是一个特殊的Categorical object。我们看到的结果描述了pandas.cut如何得到bins。可以看作是一个string数组用来表示bin的名字，它内部包含了一个categories数组，用来记录不同类别的名字，并伴有表示ages的label（可以通过codes属性查看）：

In [111]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [112]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [113]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

这里pd.value_counts(cats)是pandas.cut后bin的数量。

这里我们注意一下区间。括号表示不包含，方括号表示包含。你可以自己设定哪一边关闭（right=False）：

In [114]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

你也可以用一个list或数组给labels选项来设定bin的名字：

In [115]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [116]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

如果你只是给一个bins的数量来cut，而不是自己设定每个bind的范围，cut会根据最大值和最小值来计算等长的bins。比如下面我们想要做一个均匀分布的四个bins：

In [117]:
data = np.random.rand(20)
data

array([ 0.28442285,  0.56966156,  0.26459552,  0.50330755,  0.80332702,
        0.32116137,  0.09295453,  0.37865661,  0.64401728,  0.66416926,
        0.51858242,  0.97101668,  0.98377647,  0.75649642,  0.75826137,
        0.49692885,  0.74899541,  0.51774497,  0.6643098 ,  0.09054631])

In [118]:
pd.cut(data, 4, precision=2)

[(0.09, 0.31], (0.54, 0.76], (0.09, 0.31], (0.31, 0.54], (0.76, 0.98], ..., (0.31, 0.54], (0.54, 0.76], (0.31, 0.54], (0.54, 0.76], (0.09, 0.31]]
Length: 20
Categories (4, interval[float64]): [(0.09, 0.31] < (0.31, 0.54] < (0.54, 0.76] < (0.76, 0.98]]

precision=2选项表示精确到小数点后两位。

一个近似的函数，qcut，会按照数据的分位数来分箱。取决于数据的分布，用cut通常不能保证每一个bin有一个相同数量的数据点。而qcut是按百分比来切的，所以可以得到等数量的bins：

In [119]:
data = np.random.randn(1000) # Normally distributed

In [120]:
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-3.38, -0.672], (-0.0125, 0.661], (-0.0125, 0.661], (-0.672, -0.0125], (-3.38, -0.672], ..., (-0.0125, 0.661], (-0.0125, 0.661], (0.661, 2.968], (0.661, 2.968], (0.661, 2.968]]
Length: 1000
Categories (4, interval[float64]): [(-3.38, -0.672] < (-0.672, -0.0125] < (-0.0125, 0.661] < (0.661, 2.968]]

In [121]:
pd.value_counts(cats)

(0.661, 2.968]       250
(-0.0125, 0.661]     250
(-0.672, -0.0125]    250
(-3.38, -0.672]      250
dtype: int64

类似的，在cut中我们可以自己指定百分比：

In [122]:
cats2 = pd.cut(data, [0, 0.1, 0.5, 0.9, 1.]) # 累计的百分比
cats2

[NaN, (0.5, 0.9], (0.1, 0.5], NaN, NaN, ..., (0.0, 0.1], (0.5, 0.9], (0.9, 1.0], NaN, NaN]
Length: 1000
Categories (4, interval[float64]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [123]:
pd.value_counts(cats2)

(0.1, 0.5]    148
(0.5, 0.9]    125
(0.0, 0.1]     33
(0.9, 1.0]     25
dtype: int64

过滤或转换异常值是数组操作的一个重头戏。

In [124]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014866     0.023667     0.046588    -0.015438
std       0.994086     1.004174     1.016922     1.022323
min      -3.224296    -3.471897    -2.931033    -3.183277
25%      -0.669210    -0.657011    -0.625306    -0.691133
50%      -0.016427     0.015158     0.074415    -0.005658
75%       0.624280     0.702911     0.690223     0.661275
max       2.821729     3.599740     3.986659     3.177500

假设我们想要找一个列中，绝对值大于3的数字：

In [125]:
col = data[2]
col.head()

0    0.606866
1   -1.132722
2   -0.093386
3   -0.824936
4   -0.455879
Name: 2, dtype: float64

In [126]:
col[np.abs(col) > 3]

359    3.986659
614    3.081626
Name: 2, dtype: float64

选中所有绝对值大于3的行，可以用any方法在一个boolean DataFrame上：

In [127]:
data[(np.abs(data) > 3).any(1)] # any中axis=1表示column

            0         1         2         3
134 -0.168906  3.599740  0.432667 -0.221630
359  0.627385  0.987175  3.986659  1.579018
373 -0.015087  0.859597  0.215970  3.177500
608 -0.390787 -3.471897  2.959767 -1.788496
614  0.384752 -0.848179  3.081626 -0.204883
883 -0.690678 -0.210975 -1.594516 -3.183277
926 -3.224296  0.020694  0.419831 -2.420752

下面是把绝对值大于3的数字直接变成-3或3：

In [128]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [129]:
data[98:100]

           0         1         2         3
98  0.030058  1.376459 -0.042225 -0.964903
99  0.318602  0.346535 -1.676300  0.906816

In [130]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.014641     0.023539     0.045520    -0.015432
std       0.993386     1.000675     1.013327     1.021231
min      -3.000000    -3.000000    -2.931033    -3.000000
25%      -0.669210    -0.657011    -0.625306    -0.691133
50%      -0.016427     0.015158     0.074415    -0.005658
75%       0.624280     0.702911     0.690223     0.661275
max       2.821729     3.000000     3.000000     3.000000

np.sign(data)会根据值的正负号来得到1或-1：

In [131]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0 -1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0 -1.0  1.0

排列（随机排序）一个series或DataFrame中的row，用numpy.random.permutation函数很容易就能做到。调用permutation的时候设定好你想要进行排列的axis，会产生一个整数数组表示新的顺序：

In [132]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [133]:
sampler = np.random.permutation(5)
sampler

array([3, 4, 1, 0, 2])

这个数组能被用在基于iloc上的indexing或take函数：

In [134]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

为了选中一个随机的子集，而且没有代替功能(既不影响原来的值，返回一个新的series或DataFrame)，可以用sample方法：

In [135]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

如果想要生成的样本带有替代功能(即允许重复)，给sample中设定replace=True：

In [136]:
choices = pd.Series([5, 7, -1, 6, 4])

draws = choices.sample(n=10, replace=True)

draws

3    6
1    7
3    6
3    6
3    6
2   -1
0    5
1    7
3    6
2   -1
dtype: int64

Dummy Variables：虚拟变量，又称虚设变量、名义变量或哑变量,用以反映质的属性的一个人工变量,是量化了的自变量,通常取值为0或1。

另一种在统计模型上的转换或机器学习应用是把一个categorical variable(类别变量)变为一个dummy or indicator matrix（虚拟或指示器矩阵）。如果DataFrame中的一列有k个不同的值，我们可以用一个矩阵或DataFrame用k列来表示，1或0。pandas有一个get_dummies函数实现这个工作，当然，你自己设计一个其实也不难。这里举个例子：

In [137]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [138]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

在一些情况里，如果我们想要给column加一个prefix， 可以用data.get_dummies里的prefix参数来实现：

In [139]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [140]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## Combining and Merging Datasets（合并数据集）

merge或join操作，能通过一个或多个key，把不同的数据集的行连接在一起。这种操作主要集中于关系型数据库。pandas中的merge函数是这种操作的主要切入点：

In [141]:
import pandas as pd
import numpy as np

In [142]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [143]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

这个例子是many-to-one join（多个变为一个的连接）；在df1中有标签为a和b的行，而df2中的key列，每一行只有对应的一个值。调用merge我们可以得到：

In [144]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

这里我们并没有指定按哪一列来连接。如果我们没有指定，merge会用两个对象中都存在的列名作为key（键）。当然，最好还是清楚指定比较好：

In [145]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

如果每一个对象中的列名不一会，我们可以分别指定：

In [146]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                             'data1': range(7)})

df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 
                             'data2': range(3)})

In [147]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

我们可能注意到，在结果中并没有c和d。因为merge默认是inner join(内连接)，结果中的key是交集的结果，或者在两个表格中都有的集合。其他一些可选项，比如left, right, outer。outer join（外连接）取key的合集，其实就是left join和right join同时应用的效果：

In [148]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

many-to-many(多对多)连接也被定义好了，不过可能不是那么直观。

In [149]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                    'data1': range(6)})

df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [150]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 
                    'data2': range(5)})
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [151]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
..    ...  ..    ...
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

[11 rows x 3 columns]

many-to-many join是对行进行笛卡尔集运算。（两个集合X和Y的笛卡儿积（Cartesian product），又称直积，在集合论中表示为X × Y，是所有可能的有序对组成的集合。比如1到13是一个集合，四种花色是一个集合，二者的笛卡尔积就有52个元素）。这里在左侧的DataFrame中有三行含b，右边的DataFrame则有两行含b，于是结果是有六行含b。这个join方法只会让不相同的key值出现在最后的结果里：

In [152]:
pd.merge(df1, df2, how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

用多个key来连接的话，用一个含有多个列名的list来指定：

In [153]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 
                     'key2': ['one', 'two', 'one'], 
                     'lval': [1, 2, 3]})

right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 
                      'key2': ['one', 'one', 'one', 'two'], 
                      'rval': [4, 5, 6, 7]})

In [154]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

哪一种key组合会出现在结果里取决于merge方法的选择，可以把多个key当做一个tuple组成的单一key（尽管实际上并不是这样）。

注意：当我们讲列和列进行连接时，DataFrame中的index对象会被丢弃。

最后一个问题是在做merge操作的时候，如何处理重叠的列名。当我们想要手动去解决重叠问题时（参考重命名axis labels的部分），merge有一个suffixes选项，能让我们指定字符串，添加重叠的列名到左、右DataFrame：

In [155]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [156]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

在一些情况下，用于归并的key（键），可能是DataFrame中的index。这种情况下，可以使用left_index=True 或 right_index=True来指明，哪一个index被用来作为归并键：

In [157]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 
                      'value': range(6)})

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [158]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

In [159]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

merge的默认方法是用key的交集，我们也可以设定用合集，即outer join：

In [160]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

对于那些有多层级索引的数据，就更复杂了。index上的merge默认会是multiple-key merge(复数键归并)：

In [161]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'], 
                      'key2': [2000, 2001, 2002, 2001, 2002], 
                      'data': np.arange(5.)})
lefth

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [162]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 
                              'Ohio', 'Ohio'], 
                             [2001, 2000, 2000, 2000, 2001, 2002]], 
                      columns=['event1', 'event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

在这个例子里，我们必须指明将多列归并作为一个list（注意处理重复index的方法是令how='outer'）：

In [163]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], 
         right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

In [164]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

   data    key1  key2  event1  event2
0   0.0    Ohio  2000     4.0     5.0
0   0.0    Ohio  2000     6.0     7.0
1   1.0    Ohio  2001     8.0     9.0
2   2.0    Ohio  2002    10.0    11.0
3   3.0  Nevada  2001     0.0     1.0
4   4.0  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000     2.0     3.0

同时使用两个对象里的index来归并也是可能的：

In [165]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                     index=['a', 'c', 'e'], 
                     columns=['Ohio', 'Nevada'])

left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [166]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], 
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [167]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

DataFrame有一个很便利的join实例，可以直接用index来连接。这个也可以用于与其他DataFrame进行连接，要有一样的index但不能有重叠的列：

In [168]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

由于一些历史原因，在早期的pandas版本中，DataFrame的join方法是在连接键上做left join（左连接），这样会保留左侧Dataframe的行索引。这也支持把传入的dataframe的index与被调用的DataFrame的column连接在一起：

In [169]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

最后，对于简单的index-on-index连接，可以直接给join传入一个DataFrame。（作为备选，也可以使用最普遍的concat函数，这个在下一节会做介绍）：

In [170]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]], 
                       index=['a', 'c', 'e', 'f'], 
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [171]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [172]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

另一种结合方式被称为可互换的，比如concatenation, binding, or stacking(串联，绑定，堆叠)。Numpy中的concatenate函数可以作用于numpy 数组：

In [173]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [174]:
np.concatenate([arr, arr], axis=1)

array([[  0.,   1.,   2.,   3.,   0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.,   4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.,   8.,   9.,  10.,  11.]])

而在pandas的对象中，比如Series和DataFrame，labeled axes（便签化的轴）能让我们做更泛化的数组串联操作。不过我们可能会有下面一些疑问：

如果一个对象在其他轴上的index不同，我们应不应该在这些轴上把不同的元素合并起来，或者只用交集?

经过串联操作后，连接的部分在输出对象里应不应该是可被识别的？

concatenation axis（串联轴）含有的数据需要被保留吗？在很多情况下，DataFrame中一些用整数做的label（标签）其实最好在串联后被删除。

pandas中的concat函数能解决上面这些问题。这里会给出几个例子来说明。假设我们有三个Series，他们指明没有index overlap(索引重叠)：

In [175]:
s1 = pd.Series([0, 1], index=['a', 'b'])

s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

s3 = pd.Series([5, 6], index=['f', 'g'])

调用concat，把上面的series放在一个list里，结果会把值和索引都整合在一起：

In [176]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

默认情况下，concat中axis=0，结果会得到一个新的series。如果令axis=1，结果会变成一个DataFrame（axis=1 是列）：

In [177]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

这种情况下，不会与其他轴产生重叠，效果与join中的outer join一样。你也可以通过设定join='inner'来使用交集：

In [178]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [179]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [180]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [181]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

一个潜在的问题是串联的部分在结果里是不可辨识的。假设我们想在串联轴上创建一个多层级索引，我们需要用到keys参数：

In [182]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [183]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

如果是设定axis=1，那么keys会变为DataFrame的column header(列头)：

In [184]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [185]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], 
                   columns=['one', 'two'])

df1

   one  two
a    0    1
b    2    3
c    4    5

In [186]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], 
                   columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [187]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

如果导入一个dict而不是list，那么dict的key会被用于上面concat中的keys选项：

In [188]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

可以给创建的axis level(轴层级)用names参数来命名：

In [189]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

最后我们关心的是，在DataFrame中，行索引（row index）没有包含相关的数据：

In [190]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0 -1.662326 -0.381228  0.441666 -0.267731
1  0.026401 -1.357111  0.338384 -1.482865
2  0.203372  0.965694 -0.261024  1.885389

In [191]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df2

          b         d         a
0 -0.025670 -1.131476  0.471995
1 -0.608002 -0.782837 -0.089585

In [192]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -1.662326 -0.381228  0.441666 -0.267731
1  0.026401 -1.357111  0.338384 -1.482865
2  0.203372  0.965694 -0.261024  1.885389
3  0.471995 -0.025670       NaN -1.131476
4 -0.089585 -0.608002       NaN -0.782837

In [193]:
pd.concat([df1, df2])

          a         b         c         d
0 -1.662326 -0.381228  0.441666 -0.267731
1  0.026401 -1.357111  0.338384 -1.482865
2  0.203372  0.965694 -0.261024  1.885389
0  0.471995 -0.025670       NaN -1.131476
1 -0.089585 -0.608002       NaN -0.782837

另一种数据合并方法既不属于merge，也不属于concatenation。比如两个数据集，index可能完全覆盖，或覆盖一部分。这里举个例子，考虑下numpy的where函数，可以在数组上进行类似于if-else表达式般的判断：

In [194]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], 
              index=['f', 'e', 'd', 'c', 'b', 'a'])

a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [195]:
b = pd.Series(np.arange(len(a), dtype=np.float64), 
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [196]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  5. ])

Series有一个combine_first方法，效果和上面是一样，而且还会自动对齐（比如把index按字母进行排列）：

In [197]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

对于DataFrame，combine_first可以在列与列之间做到同样的事情，可以认为是用传递的对象，给调用对象中的缺失值打补丁：

In [198]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan], 
                    'b': [np.nan, 2., np.nan, 6.], 
                    'c': range(2, 18, 4)})

df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [199]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 
                    'b': [np.nan, 3., 4., 6., 8.]})
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [200]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## Data Aggregation and Group Operations（数据汇总和组操作）

In [201]:
import numpy as np
import pandas as pd

In [202]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  0.136608  0.552877    a  one
1 -1.511016  1.416528    a  two
2 -0.915869 -0.399887    b  one
3  0.668359  1.245610    b  two
4  1.549249 -1.002843    a  one

假设我们想要，通过使用key1作为labels，来计算data1列的平均值。有很多方法可以做到这点，一种是访问data1，并且使用列（a series）在key1上，调用groupby。(译者：其实就是按key1来进行分组，但只保留data1这一列)：

In [203]:
grouped = df['data1'].groupby(df['key1'])

这个grouped变量是一个GroupBy object(分组对象)。实际上现在还没有进行任何计算，除了调用group key(分组键)df['key1']时产生的一些中间数据。整个方法是这样的，这个GroupBy object(分组对象)已经有了我们想要的信息，现在需要的是对于每一个group（组）进行一些操作。例如，通过调用GroupBy的mean方法，我们可以计算每个组的平均值：

In [204]:
grouped.mean()

key1
a    0.058281
b   -0.123755
Name: data1, dtype: float64

In [205]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.842929
      two    -1.511016
b     one    -0.915869
      two     0.668359
Name: data1, dtype: float64

In [206]:
means.unstack()

key2       one       two
key1
a     0.842929 -1.511016
b    -0.915869  0.668359

一个很有用的GroupBy方法是size，会返回一个包含group size(组大小)的series：

In [207]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

GroupBy对象支持迭代，能产生一个2-tuple（二元元组），包含组名和对应的数据块。考虑下面的情况：

In [208]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.136608  0.552877    a  one
1 -1.511016  1.416528    a  two
4  1.549249 -1.002843    a  one
b
      data1     data2 key1 key2
2 -0.915869 -0.399887    b  one
3  0.668359  1.245610    b  two

对于有多个key的情况，元组中的第一个元素会被作为另一个元组的key值（译者：可以理解为多个key的所有组合情况）：

In [209]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0  0.136608  0.552877    a  one
4  1.549249 -1.002843    a  one
('a', 'two')
      data1     data2 key1 key2
1 -1.511016  1.416528    a  two
('b', 'one')
      data1     data2 key1 key2
2 -0.915869 -0.399887    b  one
('b', 'two')
      data1    data2 key1 key2
3  0.668359  1.24561    b  two

当然，也可以对数据的一部分进行各种操作。一个便利的用法是，用一个含有数据片段（data pieces）的dict来作为单行指令(one-liner)：

In [210]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':       data1     data2 key1 key2
 0  0.136608  0.552877    a  one
 1 -1.511016  1.416528    a  two
 4  1.549249 -1.002843    a  one, 'b':       data1     data2 key1 key2
 2 -0.915869 -0.399887    b  one
 3  0.668359  1.245610    b  two}

In [211]:
pieces['b']

      data1     data2 key1 key2
2 -0.915869 -0.399887    b  one
3  0.668359  1.245610    b  two

groupby默认作用于axis=0，但是我们可以指定任意的轴。例如，我们可以按dtyple来对列进行分组：

In [212]:
grouped = df.groupby(df.dtypes, axis=1)

In [213]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.136608  0.552877
1 -1.511016  1.416528
2 -0.915869 -0.399887
3  0.668359  1.245610
4  1.549249 -1.002843
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

如果一个GroupBy对象是由DataFrame创建来的，那么通过列名或一个包含列名的数组来对GroupBy对象进行索引的话，就相当于对列取子集做聚合（column subsetting for aggregation）。这句话的意思是：

df.groupby('key1')['data1'] 
df.groupby('key1')[['data2']]
上面的代码其实就是下面的语法糖（Syntactic sugar）：

df['data1'].groupby(df['key1']) 
df[['data2']].groupby(df['key1'])

尤其是对于一些很大的数据集，这种用法可以聚集一部分列。例如，在处理一个数据集的时候，想要只计算data2列的平均值，并将结果返还为一个DataFrame，我们可以这样写：

In [215]:
df

      data1     data2 key1 key2
0  0.136608  0.552877    a  one
1 -1.511016  1.416528    a  two
2 -0.915869 -0.399887    b  one
3  0.668359  1.245610    b  two
4  1.549249 -1.002843    a  one

In [216]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.224983
     two   1.416528
b    one  -0.399887
     two   1.245610

In [217]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one    -0.224983
      two     1.416528
b     one    -0.399887
      two     1.245610
Name: data2, dtype: float64

分组信息可以不是数组的形式。考虑下面的例子：

In [218]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [219]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe    -1.146189 -0.624925  0.247634 -0.952960 -0.765948
Steve   0.133908  1.157322 -0.096322  0.590227  1.440782
Wes    -1.309911       NaN       NaN  1.727638  1.101583
Jim     0.439676 -1.969695 -1.295492  0.706245 -0.844408
Travis -0.337355 -1.324435 -1.090626  0.108471  0.589735

In [220]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

现在，我们可以通过这个dict构建一个数组，然后传递给groupby，但其实我们可以直接传入dict（可以注意到key里有一个'f'，这说明即使有，没有被用到的group key，也是ok的）：

In [221]:
by_column = people.groupby(mapping, axis=1)

In [222]:
by_column.sum()

            blue       red
Joe    -0.705326 -2.537063
Steve   0.493904  2.732012
Wes     1.727638 -0.208328
Jim    -0.589247 -2.374426
Travis -0.982156 -1.072055

这种用法同样适用于series，这种情况可以看作是固定大小的映射（fixed-size mapping）：

In [223]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [224]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

比起用dict或series定义映射关系，使用python的函数是更通用的方法。任何一个作为group key的函数，在每一个index value（索引值）上都会被调用一次，函数计算的结果在返回的结果中会被用做group name。更具体一点，考虑前一个部分的DataFrame，用人的名字作为索引值。假设我们想要按照名字的长度来分组；同时我们要计算字符串的长度，使用len函数会变得非常简单：

In [225]:
people.groupby(len).sum() # len函数在每一个index（即名字）上被调用了

          a         b         c         d         e
3 -2.016425 -2.594620 -1.047859  1.480924 -0.508773
5  0.133908  1.157322 -0.096322  0.590227  1.440782
6 -0.337355 -1.324435 -1.090626  0.108471  0.589735

混合不同的函数、数组，字典或series都不成问题，因为所有对象都会被转换为数组：

In [226]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [227]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.309911 -0.624925  0.247634 -0.952960 -0.765948
  two  0.439676 -1.969695 -1.295492  0.706245 -0.844408
5 one  0.133908  1.157322 -0.096322  0.590227  1.440782
6 two -0.337355 -1.324435 -1.090626  0.108471  0.589735

最后关于多层级索引数据集(hierarchically indexed dataset)，一个很方便的用法是在聚集（aggregate）的时候，使用轴索引的层级（One of the levels of an axis index）。看下面的例子：

In [228]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], 
                                     [1, 3, 5, 1, 3]], 
                                    names=['cty', 'tenor'])
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [229]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.069903 -1.794934  0.925745  0.182021  0.088192
1      0.138409  0.866860  0.899169  0.222585 -1.379707
2     -0.652587 -0.847905 -1.295934 -0.815090  0.452673
3     -0.932705 -0.495640 -1.457978  0.868874 -0.071564

In [230]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3